# Вывести на экран коды и символы таблицы ASCII, начиная с символа под номером 32 и заканчивая 127-м включительно. Вывод выполнить в табличной форме: по десять пар "код-символ" в каждой строке.
count = 0
for elem in range(32, 128):
    if count < 10:
        print(elem, chr(elem))
        count +=1
    else:
        print("===================================================")
        print("Block")
        print("===================================================")
        count = 0
